read_verilog -formal funrv32.v
prep -top main_mem
sat -set-assumes -prove-asserts